# I рівень
# Створіть програму, яка приймає два числа від користувача та виводить їх суму.

a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))
suma = a + b
print(f"Сума {a} + {b} = {suma}")

# II рівень
# Реалізуйте програму, яка визначає, чи є введене користувачем число простим.

n = int(input("Введіть число: "))
if n < 2:
    print(f"{n} — не є простим числом")
else:
    is_prime = True
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            is_prime = False
            break
    if is_prime:
        print(f"{n} - просте число")
    else:
        print(f"{n} - не є простим числом")
